var local_database = [{
    date: 'sep 18 2018',
    title: '月亮之子/ 我想温暖这个有你的世界',
    imgSrc: '/images/post/crab.png',
    avatar: '/images/avatar/5.png',
    content: '每天晚上，当月亮升起的时候，月亮之子就会降临地面。深夜里，他会独自一个人，无忧无虑的在月光下散步。天亮前，他就会消失',
    reading: '112',
    collection: '96',
    headImgSrc: '/images/post/crab.png',
    author: '李白',
    dataTime: '24time',
  detail: "每天晚上，当月亮升起的时候，月亮之子就会降临地面。深夜里，他会独自一个人，无忧无虑的在月光下散步。天亮前，他就会消失。没有什么目的性，他与这个世界没有什么联系。他只是以这样一种简单的姿态，在特定的时候，存在于这个世界。在一个寒冷的夜晚，他像往常一样在皎洁的月光下散步。 这时，他在路边看到了一个昏倒的小女孩。于是他把小女孩抱在怀里，带到一棵大树下，在周围点燃了一堆篝火。也许是篝火的温暖，也许是月亮之子的怀抱的温暖，不一会儿，小女孩就醒了过来。小女孩惊讶的问，你是谁啊？月亮之子撒谎道，我只是一个路过的行人，看到你昏迷，就带你过来烤烤火。你好一些了吗？小女孩本能的往月亮之子的怀里挤了挤，然后说，我没事，就是有一些累，睡一觉就好了。月亮之子抱紧她说，那就睡吧。天亮了再赶路。半夜的时候，小女孩又醒了一次，她指着那堆篝火说真好看，就像跳舞的小精灵，据说跳舞的小精灵的脚丫是火焰做的，只有内心最纯净的人才能看得到那舞蹈。月亮之子给小女孩讲了好多小故事，小女孩很开心，她说恶魔其实是个乖孩子，因为它没有伤害过任何人。她又说见习死神一定是天使变的，原来天使有时候也会撒谎。小女孩躺在月亮之子的怀里，抬头望着漫天繁星，开始数星星……没过多久，她再一次睡着了。天快亮的时候，月亮之子把外衣披在了小女孩的身上，然后往篝火里加了一些木柴，准备离开。可是他舍不得，也不放心。他知道小女孩白天的时候会继续赶路，可是天气越来越冷。他不知道自己还能做些什么。他马上就要消失了。天亮了，小女孩醒了过来。她发现盖在自己身上的衣服，她知道这是那个路人留给她的，而路人自己已经启程了。相遇和离别，有时候是一件很简单的事。没有什么特殊的理由。因为每个人都有自己的目的地。小女孩离开那堆篝火，回到自己的路上，忽然被眼前的景象震住了。路的两旁，是整整齐齐的两排篝火。熊熊的篝火，如同两条火龙一直延伸向地平线。我想温暖你，不管我在哪里。如果有一天我会离开你，那就让我温暖这个有你的世界。< 晚安 >",
    postId: 0,
    music: {
      url: "http://ws.stream.qqmusic.qq.com/C100003507bR0gDKBm.m4a?fromtag=38",
      title: "夜夜夜夜-齐秦",
      coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000001TEc6V0kjpVC.jpg?max_age=2592000"
    }
  },
  {
    //按住alt + shift + f可以格式化代码
    date: 'Oct 19 2019',
    title: '你的梦想在远方，我的梦想在天上',
    imgSrc: '/images/post/bl.png',
    avatar: '/images/avatar/1.png',
    content: "我们对这个世界充满了戒备，警惕，伤害也许来自任何一个方向，任何一种方式。然而，有一种安全感，在第一眼就可以识别。",
    reading: '135',
    collection: '62',
    headImgSrc: '/images/post/bl.png',
    author: '沃兹基',
    dataTime: '24time',
    detail: "在地图上没有显示的土地上，生长着这样一片茂密的大森林。森林里的树都非常高大，树干粗壮而笔直的向上，直插天际。树冠就像一只大伞，笼罩着树下的地面。相传，这些树都是不死不老的，它们不受时间的束缚，永远向上生长，挑衅着天空。有一天，一个背着旅行包的女孩在暴风雨里迷了路，慌忙中闯入了这片森林。茂密的树冠轻而易举的隔绝了肆虐着的暴风雨，森林里一片宁静，仿佛是另一个世界。女孩全身都湿透了，狼狈的坐在一棵大树下，整理着自己的衣物。 这时，不知从什么地方走出一个绿头发的男孩。男孩友好的问，你是谁？从哪里来？女孩说，我是一个旅行者，刚才在暴风雨里迷了路，闯进了这片森林。阿嚏！男孩很担忧的问道，你没事吧？是不是病了？ 女孩疲倦的摇摇头，谢谢你，我没事。我只是很累，睡一觉就好了。说完，女孩坐靠在树干上，很快陷入了梦乡。男孩于是坐在她旁边，静静的守着她。为什么她没有一点戒备，就这样在他面前睡觉？我们对这个世界充满了戒备，警惕，伤害也许来自任何一个方向，任何一种方式。然而，有一种安全感，在第一眼就可以识别。那种安全感可以来自于一个陌生人。它会让你知道，你可以在他面前放下一切的荆棘和盔甲。因为这世上，存在一种没有任何理由的信任，单纯而纯粹的信任。沉睡中的女孩，发梢上还带着水滴，睫毛微微抖动，鼻翼轻微的张合。男孩一直看着女孩，心里很安静，比看云朵，看星星时还安静。他甚至有那么一瞬间，希望她永远不要醒过来，就这样一直睡下去。不知道过了多久，女孩面色开始发白，嘴唇也渐渐失去了血色。身体在不停的发抖。男孩心想，糟了。她发烧了！ 他急忙冲进森林深处，去寻找各种草药和果子。然后把草药熬成汤，小心翼翼的给女孩服下。女孩喝下了草药熬的汤，面色渐渐恢复了正常。旁边一个苍老的声音说，她没事了。不过她的身子太弱了。短期内如果再经历一次暴风雨，很可能会死！男孩看着睡熟的她，坚定的说道，不会的。我会保护她，不再让她受到任何伤害！第二天，太阳出来了，森林里散发着清新潮湿的味道。女孩醒了过来，才明白昨晚是男孩照顾了她。她红着脸向男孩道谢。男孩带着女孩在森林里游玩。那些高大的树干上，布满了青色的藤蔓，藤蔓上开着五颜六色的小野花。几只小鸟在树冠里叽叽喳喳的跳来跳去。男孩看着那些粗壮的庞然大物，费解的摇摇头，你们这些老家伙为什么会甘心做一棵树呢？像我这样能走路能说话难道不好吗？那些老树告诉他，那是因为你还没有找到作一棵树的理由。男孩给她摘了很多好吃的果子，带她在小河里钓鱼，抓蝴蝶。女孩给他讲她所见到的世界各地的景观，和很多趣闻。她说她的梦想就是游遍全世界。她问男孩，你愿意和我一起去周游世界吗？男孩愣了一下，然后毫不犹豫的答应了她。第三天早上，当男孩和女孩打算离开森林的时候，男孩听到了森林里的树都在阻止他。但是他不想要这样的生活，他只想和她在一起。完成她的梦想。他拉着她的手，大步的离开了森林。他们沿着大路，向最近的一个村庄走去。随着时间的推移身后的森林越来越远，但是每当他们回头，还是可以看到那片森林。因为那些树太高了。下午的时候，天气突然大变，一眨眼的工夫，暴风雨骤起！男孩拉着女孩拼命向前奔跑，可是前面的路还很长，村庄遥遥无望。 女孩就像一只无助的蔷薇，在狂暴的风雨里颤颤发抖。男孩紧紧地抱着柔弱的身躯，可是无济于事。这时，他们脚下一滑，摔倒在泥水里。女孩晕了过去。男孩忽然想起老树们的话，女孩脆弱的身体绝不能再经历第二次暴风雨了。也想起了自己要保护她的承诺。他看了看怀里的她，叹了一口气。低下身子吻了吻她的脸颊。然后男孩后退了两步，用力把双脚插进大地。昂首张开双臂。他的脚立刻化作具有无限生命力的根须，钻向深深的地下，紧紧抓住大地。他的双臂上生出无数绿色的枝条，枝条向四面八方长大，变粗变长，然后又生出更多的枝条。 男孩健硕的身躯消失了，取而代之的是结实有力的树干，屹立在暴风雨中纹丝不动，仿佛战无不胜的泰坦巨人。短短的几分钟里，女孩的身边出现了一棵笔直高大的巨树，就像森林里那些一样。树冠把狂和雨水完全的遮挡在了外面。而女孩，静静的躺在树下。黄昏的时候，暴风雨停了。女孩也醒了过来。她伤心的发现，男孩已经不见了。她心想，也许他反悔了，或者害怕了。她很难过，因为他没有履行他的承诺，陪她完成她周游世界的梦想。女孩背起行李包，独自向前走去。走了几步，感觉忘记了什么似的回头一看。她终于看到了那棵树。 一棵奇怪的长在路中间的巨树。一定是这棵树帮她遮挡了暴风雨。她看着树轻声说道，谢谢你。然后她背着包，沿着那条路，向着太阳落山的方向走去。在暴风雨里，我不能变成一支雨伞，脆弱的躺在你手心。我只会张开双臂化作一棵树，很大很大的树，当你在我身边的时候，我会保护你不受任何伤害。如果你要离开，我也只能拼命地生长，向上生长。长到云朵之上，直直的冲向天际，这样，不管你在世界的那个角落，都能够看到我。我也能够看到你。你是流浪的旅人，我是永生不息的树。我日日夜夜的朝天生长，只为了让远方的你，能够看到天上的我。因为你的梦想在远方，我的梦想在天上。< 晚安 >",
    postId: 1,
    music: {
      url: "http://ws.stream.qqmusic.qq.com/C100003GdCmG4NkEOR.m4a?fromtag=38",
      title: "鬼迷心窍-李宗盛",
      coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000002xOmp62kqSic.jpg?max_age=2592000"
    }
  },
  {
    //按住alt + shift + F 可以格式化代码样式
    title: "见习死神/ 如果明天我将离去",
    content: "生命，是我们来到这个世界上之后，唯一平等的东西。而死亡，是这世界上最伟大的冒险。",
    imgSrc: "/images/post/sls.jpg",
    avatar: "/images/avatar/2.png",
    headImgSrc: "/images/post/sls.jpg",
    reading: 62,
    collection: 92,
    author: "知乎",
    date: "Nov 12 2018",
    dateTime: "三天前",
    detail:"曾经流传着这样的一个故事， 当你生命快要结束的时候， 会有一位死神专门来到你面前，他的任务是要设法让你接受“ 自己即将死去” 这件事， 然后带着你离开， 到底会去哪里， 谁也不知道。当然， 这个传言无从考证， 按道理说，见过死神的人都应该已经跟着他们离开了。小百合生活在混凝土森林里， 每天过着单调麻木的生活。 每天早上她一出门， 熙熙攘攘的人群就会像海浪一样把她包裹住， 直到庸庸碌碌的一天结束。 她不知道自己是为了什么而活着一个晴朗的早上， 小百合推开窗户。 阳光异常的明媚。 这时， 她发现窗台上蹲着一个小男孩。她十分惊讶：“ 你是谁啊？”小男孩平静的回答说：“ 你好， 小百灵， 我是你的死神。”“ 死神！？” 小百合感到一阵晕眩， 然后紧张的喊道“ 可是…… 等等！ 我不叫小百灵！ 我叫小百合！”“ 是吗！？” 小男孩瞬间变得比她还要紧张， 手忙脚乱的拿出一个笔记本， 开始乱翻……“ 哦对不起！ 对不起！ 我念错了， 咳咳咳…… 我们…… 我们重新再来一遍好吗？”“…… 额？” 小百合迷糊了。。。。没等她同意， 小男孩就跳到窗外， 站在半空中， 然后把窗户小心翼翼的关闭， 在玻璃外面朝小百合打着手势， 貌似是想让她打开窗户。小百合无奈的打开窗户， 小男孩立刻飞到窗台上， 摆出和刚才一样帅的造型， 蹲在小百合的面前。 一脸期待的望着她。 然后。 一片安静。两个人。大眼瞪小眼。半个小时过去了。小男孩终于忍不住了， 他弱弱的问道：“ 你…… 你难道不应该问我是谁吗？”“ 你爱说不说！” 小百合板着脸回答。小男孩尴尬的跳进屋子里， 双手捧着着笔记本， 一本正经的对她说：“ 你好， 小百合， 我是你的死神， 见习死神， 如果今天可以完成任务通过考核， 我就会正式成为死神。 谢谢合作！”“ 怎么可能！！ 你是说我快要死了吗！！”小男孩挠了挠头，“ 额， 按道理说， 应该是这样， 但是也不一定， 所以他们才派我这个见习死神来。”“ 那那那那我还有多久时间？”“ 咳咳， 你还有一天时间。 有什么没有完成的心愿， 你都可以赶快完成， 生命很珍贵， 不要留下遗憾。” 有什么心愿？ 小百合想来想去， 突然想起来小时候常常去奶奶家门前的小河边钓鱼， 长大后， 她已经很久没有去钓鱼了。 她忽然好想钓鱼。 于是她决定用最后的一天时间来钓鱼， 把它作为自己最后的一段美好的回忆。见习死神陪小百合在郊外待了整整一天， 他们钓了一大桶鱼。夜色降临， 小百合对见习死神说：“ 谢谢你满足了我最后的一个心愿， 我们走吧”见习死神摇摇头说：“ 先不急， 你还有什么心愿吗？ 一起完成了吧。” 她想了想：“ 我想把这些鱼煮给你吃， 作为对你的感谢！”见习死神高兴的说：“ 好啊！ 不过今天时间不早了， 早点休息。 你明天煮给我吃吧！” 不等小百合反应过来， 见习死神就飞走了。第二天的早晨， 依然很晴朗。 小百合一起床就去打开窗户， 见习死神迫不及待的跳进来， 嚷着要吃鱼， 并且说吃完鱼就带她走。小百合其实有着很好的厨艺， 只不过平时太忙碌， 也没有兴趣好好地做一顿饭。她心想， 既然这是最后一次做饭了， 那就好好地为自己做一顿大餐， 作为最后的晚宴。 这样也就没什么遗憾了。整整一天， 她都在做着各式各样的菜肴， 当然， 主要的大菜还是鱼， 红烧鱼， 清蒸鱼， 糖醋鱼。。。。 晚饭的时候， 见习死神可谓是大饱口福。 临走时还两只手各拎了一条鱼， 说是要给前辈们常常。 “ 你看我两只手都拎着鱼， 没法带你走。 要不， 明天我再来找你吧” 见习死神打着嗝， 晃晃悠悠的飞走了。“。。。。。。” 小百合很无语的看着他的背影。当天夜里下了大雨。 温度骤降。 第三天早上， 小百合打开窗户的时候， 一个湿淋淋的人影迅速冲进来， 她仔细一看， 原来是被大雨淋成了落汤鸡的见习死神阁下。见习死神惨白的脸打着哆嗦说到：“ 快…… 给我拿一杯热水！ 阿嚏！” 小百合拿来热水和体温计， 发现他发了高烧， 烧得满嘴胡话， 小百合喂他吃了药， 并且照顾了他一整天。 她从来不知道原来自己也懂得照顾人， 而且可以照顾得这么好。傍晚时， 见习死神已经好的差不多了。小百合告诉他， 郊外的山上有一种草， 治伤寒感冒特别好， 如果有那种药， 他的病会好得更快。 见习死神连忙说：“ 那我明天再带你走！ 你明天帮我熬那种药好吗？ 我最讨厌生病了！”“ 好吧…… 明天见， 见习死神！”向死而生就这样， 一天天过去了， 每天傍晚， 小百合都会找到下一件需要去做的事， 而死神呢， 也会一次次的延长她的寿命， 每一次都只是延长一天。 她发现自己的生命不但没有缩短和消失， 反而变得充实起来。见习死神， 一直没有成为真正的死神， 因为他的任务， 始终没有完成。 直到有一天， 见习死神没有出现在小百合的窗台。后来， 他再也没有出现。 我为了什么而活着？ 我们常常问自己。答案很多。为了父母， 为了亲人， 为了朋友， 为了爱情， 为了实现理想， 为了履行使命。我们来到这个世上， 遇见那么多人， 经历那么多事， 成长， 蜕变， 痛苦， 更多的是快乐。 你的生命， 你想要怎样的对待。 如果明天你将离去， 你还有什么事要做，未来足够你爱。 <晚安 >",
    postId: 2,
    music: {
      url: "http://ws.stream.qqmusic.qq.com/C100004HLusI2lLjZy.m4a?fromtag=38",
      title: "女儿情-万晓利",
      coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000004Wv5BO30pPc0.jpg?max_age=2592000"
    }
  },
  {
    title: "你不要融化，我会陪你看一百万次日出",
    content: "从前，有一片美丽的森林。森林里生活着一只快乐的小猴子。它每天的生活就是在树木之间跳跃，和伙伴们嬉戏打闹。",
    imgSrc: "/images/post/vr.png",
    reading: 102,
    collection: 26,
    dateTime: "24小时前",
    headImgSrc: "/images/post/vr.png",
    author: "深白色",
    date: "Nov 20 2018",
    avatar: "/images/avatar/4.png",
    detail: "从前，有一片美丽的森林，森林里生活着一只快乐的小猴子。它每天的生活就是在树木之间跳跃，和伙伴们嬉戏打闹。森林的尽头是一座大山，山顶常年被冰雪覆盖。没有人爬上过那座雪山的山顶，而且大家也相信，爬上去的人，再也回不来。据说山顶上有很多动物形状的雪人，那些都是曾经试图爬上山顶的动物，他们被永远地留在了山顶。冬季来临了，空气变得很冷，直到有一天，天空中飘下雪花，雪花越来越大，越来越多，森林里的绿色渐渐地被纯粹的白色所取代。没过多久，冰雪覆盖了整个森林。在大雪覆盖森林的日子里，小猴子耐不住窝在家里的无聊时光，常常一个人跑出来玩耍。冰雪的世界，很安静，安静的易碎。所有的树木都睡着了。他从一棵树轻巧的跳到另一棵树上，树干上的雪块被震落，纷纷扬扬的洒下来。他的呼吸声和心跳声，仿佛都有了回音。这片森林忽然成为了他一个人的国度。直到他遇到了那个雪人。那个雪人围着红色的围巾，静静的站在一个松树下。黑色的大眼睛里，带着一点点伤感，它仰望着天空，不知道在想什么。小猴子高兴极了，他悄悄的爬到那棵松树上，从天而降到雪人面前，想吓它一跳。可是雪人只是平静的看了看他，说，你好。嗯，你好。小猴子尴尬的笑了笑。雪人说，你笑起来真好看，我就不会笑，雪人只可以有一种表情。我不知道我从哪里来，也不知道自己要做什么，只是每天看看日出，就觉得很开心。小猴子拍着胸脯说，那我以后陪你看日出吧。——真的吗？看几次——几次？当然是好多次！……看一百万次！雪人平静的听着小猴子的豪言壮语。没有回答。这是承诺吗。有时候，一句简单的话，会被说出的人和听到的人念念不忘，在我们不知道为什么而活着的时候，那几句特别的话，就会成为了我们生活的意义。每天清晨，小猴子都会准时出现在雪人的身边，陪它看日出。太阳的第一缕光线照射在雪人圆圆的脸上，映出红灿灿的光辉，仿佛带着一种很特别的温度。小猴子心想，如果雪人会笑，一定会很美。可惜雪人总也学不会笑。只有小猴子为了教它，整天对着它保持着笑脸，差点笑到抽经。这是一个特别的冬季。小猴子整个冬天都没有感觉到寒冷，他过得很充实。整整一个冬天，他和雪人一起看日出，数云朵，在雪地上画画，小猴子还一度想教会雪人爬树————这种努力当然是徒劳的，因为对雪人来说，这比笑还难。。。。。。日子过得很快，春天终于回来了。在他们看第55个日出的时候，雪人的脸上布满了水珠，把小猴子吓了一跳。小猴子问，雪人，你怎么哭了？雪人说，我不是哭，春天来了，我要融化了。小猴子慌了，他大声喊道，你不要融化！你不要融化啊！我们说好了要看一百万次日出的！雪人全身都在流汗，脸上布满了水痕，平静的说，我只能活在冬天里，冬天过去，我就会消失。即使是你，也只能活几十年，怎么可能看一百万次日出呢。笨蛋。谢谢你陪我看的这55个日出，我会永远记住的，也请你不要忘了我。小猴子拼命摇头，不会的。我说过的要带你看一百万次日出，就一定会做到！我不会让你消失的。你都没有对我笑过。这时小猴子忽然转头，望向森林尽头的雪山，心里下了一个决定。他抱起雪人，飞一般的冲向雪山脚下。等到他们来到了山脚下，已经奄奄一息的雪人才反应过来小猴子的意图。它虚弱的说，你不要上去，上面的暴风雪会冻死你的。小猴子说，我要给你一个永不消失的冬天。小猴子紧紧抱着雪人，开始向山顶攀登。随着海拔的增加，暴风雪的威力也增加了，小猴子咬紧牙关拼命攀爬。他看了看怀里的雪人，雪人已经停止了融化，但依然没有醒过来。不知道过了多久，他们奇迹般的来到了雪山的山顶。已经快要冻僵的小猴子，松开了发抖的双手，把雪人放在面向东方的巨石上，然后如释重负的坐在了它的旁边。他已经感觉不到任何寒冷了。他知道，自己马上就要冻死了。身旁的雪人在暴风雪的滋补下，身形开始重新塑造。相信过不了多久，就可以重新睁开眼睛。在小猴子结冰之前，他用尽全身的力气挤出最后一个微笑。这个微笑被时间凝固起来，永远的封存。雪人醒来的时候，她看到身边已经冻僵了的小猴子，正在对着她微笑，仿佛像往常一样，在教她怎么微笑。雪人笑了。地上刻着一行字：你不要融化，不要离开我，我们说好了要看一百万次日出，少一次都不行。从前有一座山。山顶上有一块巨石。一只雪人和一只猴子，他们在雪山的巨石上相互依靠着，坐了三千年。如果我要离开，那就把时间凝固在我微笑的时候。这样你会看到，我在对着你笑，永远对着你笑，总有一天，你会学会对我微笑。你对我说，你注定属于寒冷。那就让我去你的世界，这样，我们是不是可以抱的更近一点？再近一点好不好，一点就行。我不贪心。就算你的世界里全是暴风雪，我也会微笑着陪你。我不离开。<晚安>",
    postId: 3,
    music: {
      url: "http://ws.stream.qqmusic.qq.com/C100000Zn0vS4fKKo8.m4a?fromtag=38",
      title: "沉默是金-张国荣",
      coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000003at0mJ2YrR2H.jpg?max_age=2592000"
    }
  },
  {
    title: "三个神明",
    content: "天上有两个神明。第一个神明，让我在时间长河中遇到那么多人，经历那么多事。伤心和快乐，难过和喜悦，兴奋与失落，成功和失败。",
    imgSrc: "/images/iqiyi.png",
    reading: 96,
    collection: 26,
    dateTime: "21小时前",
    headImgSrc: "/images/iqiyi.png",
    author: "深白色",
    date: "Nov 20 2018",
    avatar: "/images/avatar/5.png",
    detail: "天上有两个神明。第一个神明，让我在时间长河中遇到那么多人，经历那么多事。伤心和快乐，难过和喜悦，兴奋与失落，成功和失败。历经千辛万苦，困于七情六欲，让我的灵魂成为了现在的样子。 第二个神明，让我在这个世界上有时一路顺风，有时险阻重重，或在这个路口转弯，或在那个路口停滞。我曾经翻身越岭，也曾经守候一道月光。然后我，此时此刻，出现在你身旁。不早不晚，顺其自然。遇到你。这个过程，我一度不理解，并为之折磨。但这个结果，我欣然接受。我想，应该还有第三个神明。它会告诉我，你是对的人。< 晚安 >。",
   
    postId: 4,
    music: {
      url: "http://ws.stream.qqmusic.qq.com/C100002I8eGJ28BI17.m4a?fromtag=38",
      title: "朋友-谭咏麟",
      coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000004eGsCN3SUheO.jpg?max_age=2592000"
    }
  },
]

// var a = "2" 可以随便添加

// 给脚本文件定义一个出口
module.exports = {
  postList: local_database,
  // a_key: a
}